soa-java-soap/src/main/resources/city-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://cities.sources.com">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCityRequest>
         <gs:id>2</gs:id>
      </gs:getCityRequest>
   </soapenv:Body>
</soapenv:Envelope>
