soa-java-soap/src/main/resources/samples/cities-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://cities.sources.com">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCitiesRequest>
         <gs:term>v</gs:term>
      </gs:getCitiesRequest>
   </soapenv:Body>
</soapenv:Envelope>
